app/controllers/blogs_controller.rb

SELECT * FROM "blogs"
---
  def index
    @blogs = Blog.all

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
---
  def show
    @blog = Blog.find(params[:id])

INSERT INTO "blogs" ("created_at", "title", "updated_at", "content") VALUES('2010-05-29 05:53:39', 'Wow', '2010-05-29 05:53:39', 'Hello world')
---
  def create
    @blog = Blog.new(params[:blog])
    if @blog.save

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
---
  def edit
    @blog = Blog.find(params[:id])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 5)
UPDATE "blogs" SET "updated_at" = '2010-05-29 07:14:45', "content" = 'Hello world1' WHERE "id" = 1
---
  def update
    @blog = Blog.find(params[:id])
    if @blog.update_attributes(params[:blog])