app/controllers/comments_controller.rb

  def index
    @comments = @blog.comments.all
---
SELECT * FROM "comments" WHERE ("comments".blog_id = 1)

  def show
    @comment = @blog.comments.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 3 AND ("comments".blog_id = 1))

  def edit
    @comment = @blog.comments.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 2 AND ("comments".blog_id = 1))